Merge pull request #1 from Gakha-Pitskhelauri/dev
final assignment updates
